lbekit/MicroprocessorProjects/board/pin_mux.h
/*! @name PIO1_21 (number 30), P17[3]/P24[6]/FC4_I2C_SDA_ARD
  @{ */
#define SETDEFAULTROUTING_FC4_I2C_SDA_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define SETDEFAULTROUTING_FC4_I2C_SDA_PIN 21U                   /*!<@brief PORT pin number */
#define SETDEFAULTROUTING_FC4_I2C_SDA_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO1_19 (number 58), U7[3]/P18[14]/PLU_OUT1/GPIO
  @{ */
#define SETDEFAULTROUTING_ACCL_INTR_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define SETDEFAULTROUTING_ACCL_INTR_PIN 19U                   /*!<@brief PORT pin number */
#define SETDEFAULTROUTING_ACCL_INTR_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO1_18 (number 64), S2/P18[16]/P24[2]/WAKE/GPIO
  @{ */
#define SETDEFAULTROUTING_S2_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define SETDEFAULTROUTING_S2_PIN 18U                   /*!<@brief PORT pin number */
#define SETDEFAULTROUTING_S2_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_20 (number 74), P17[10]/FC7_I2S_TX
  @{ */
#define SETDEFAULTROUTING_FC7_I2S_TX_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define SETDEFAULTROUTING_FC7_I2S_TX_PIN 20U                   /*!<@brief PORT pin number */
#define SETDEFAULTROUTING_FC7_I2S_TX_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO0_21 (number 76), P17[14]/FC7_I2S_SCK
  @{ */
#define SETDEFAULTROUTING_FC7_I2S_SCK_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define SETDEFAULTROUTING_FC7_I2S_SCK_PIN 21U                   /*!<@brief PORT pin number */
#define SETDEFAULTROUTING_FC7_I2S_SCK_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO0_22 (number 78), P10[1]/USB0_VBUS
  @{ */
#define SETDEFAULTROUTING_USB0_VBUS_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define SETDEFAULTROUTING_USB0_VBUS_PIN 22U                   /*!<@brief PORT pin number */
#define SETDEFAULTROUTING_USB0_VBUS_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO1_16 (number 87), P18[17]/SD1_PWR_EN
  @{ */
#define SETDEFAULTROUTING_FC6_I2S_WS_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define SETDEFAULTROUTING_FC6_I2S_WS_PIN 16U                   /*!<@brief PORT pin number */
#define SETDEFAULTROUTING_FC6_I2S_WS_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO0_19 (number 90), P17[12]/FC7_I2S_WS
  @{ */
#define SETDEFAULTROUTING_FC7_I2S_WS_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define SETDEFAULTROUTING_FC7_I2S_WS_PIN 19U                   /*!<@brief PORT pin number */
#define SETDEFAULTROUTING_FC7_I2S_WS_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO1_31 (number 91), P19[7]/P19[8]/PLU_IN0/GPIO
  @{ */
#define SETDEFAULTROUTING_MCLK_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define SETDEFAULTROUTING_MCLK_PIN 31U                   /*!<@brief PORT pin number */
#define SETDEFAULTROUTING_MCLK_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_29 (number 92), P8[2]/U6[13]/FC0_USART_RXD
  @{ */
#define SETDEFAULTROUTING_DEBUG_UART_RX_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define SETDEFAULTROUTING_DEBUG_UART_RX_PIN 29U                   /*!<@brief PORT pin number */
#define SETDEFAULTROUTING_DEBUG_UART_RX_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO0_30 (number 94), P8[3]/U6[12]/FC0_USART_TXD
  @{ */
#define SETDEFAULTROUTING_DEBUG_UART_TX_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define SETDEFAULTROUTING_DEBUG_UART_TX_PIN 30U                   /*!<@brief PORT pin number */
#define SETDEFAULTROUTING_DEBUG_UART_TX_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SetDefaultRouting(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define PIO1_9_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_9_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO1_9 (number 10), S3/P18[1]/PIO1_9_GPIO_ARD
  @{ */
#define BOARD_INITPINS_S3_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S3_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S3_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Board_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
